Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Comment>Уникальный идентификатор устройства стандарта оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Comment>Наименование модели устройства стандарта внешнего оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикДрайвера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/МенеджерОборудованияКлиент/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////
////////////// МОДУЛЬ УПРАВЛЕНИЯ ПОДКЛЮЧАЕМЫМ ОБОРУДОВАНИЕМ (на клиенте) ////////
////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////
////////////// ОБЩИЕ МЕТОДЫ УПРАВЛЕНИЯ ОБОРУДОВАНИЕМ //////////////

/////////////////// ПОДКЛЮЧЕНИЕ ОБОРУДОВАНИЯ ///////////////////////////

// Производит подключение доступного оборудования по списку типов ПО
//
Функция ПодключитьОборудованиеПоТипу(ИдентификаторКлиента, ТипыПО, ОписаниеОшибки = "") Экспорт

	СтруктураТиповПО = Новый Структура();
	Если ТипЗнч(ТипыПО) = Тип("Массив") Тогда
		Для каждого ТипПО Из ТипыПО Цикл
			СтруктураТиповПО.Вставить(ТипПО);
		КонецЦикла;
	Иначе
		СтруктураТиповПО.Вставить(ТипыПО);
	КонецЕсли;

	Возврат ПодключитьОборудование(ИдентификаторКлиента, СтруктураТиповПО, , ОписаниеОшибки);

КонецФункции

// Подключает одиночный экземпляр устройства определяемый идентификатором
//
Функция ПодключитьОборудованиеПоИдентификатору(ИдентификаторКлиента, ИдентификаторУстройства,
                                               ОписаниеОшибки = "") Экспорт

	Возврат ПодключитьОборудование(ИдентификаторКлиента, , ИдентификаторУстройства, ОписаниеОшибки);

КонецФункции

// Функция подключает устройства по типу оборудования
// Возвращает результат выполнения функции.
Функция ПодключитьОборудование(ИдентификаторКлиента, ТипыПО = Неопределено,
                               ИдентификаторУстройства = Неопределено, ОписаниеОшибки = "")

	КонечныйРезультат = Истина;
	Результат         = Истина;

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	ОбъектДрайвера    = Неопределено;
	ОписаниеОшибки    = "";
	ОписаниеОшибкиУстройства = "";

	Результат = МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
	Если Не Результат Тогда
		ОписаниеОшибки = НСтр("ru = 'Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");

		Возврат Ложь;
	КонецЕсли;

	СписокОборудования =
	 МенеджерОборудованияКлиентПовтИсп.ПолучитьСписокОборудования(ТипыПО,
	                                                              ИдентификаторУстройства);

	Если СписокОборудования.Количество() > 0 Тогда
		Для каждого Устройство Из СписокОборудования Цикл
			//Проверим, не подключено ли устройство ранее
			ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО,
			                                                        Устройство.Ссылка);

			Если ПодключенноеУстройство = Неопределено Тогда // Если устройство не было подключено ранее

				ОбъектДрайвера = ПолучитьОбъектДрайвера(Устройство.ОбработчикДрайвера);
				Если ОбъектДрайвера = Неопределено Тогда
					//Сообщить об ошибке, что не удалось загрузить драйвер.
					ОписаниеОшибки = ОписаниеОшибки + ?(ПустаяСтрока(ОписаниеОшибки), "", Символы.ПС)
					               + НСтр("ru = '%Наименование%: Не удалось загрузить драйвер устройства.
					                 |Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", Устройство.Наименование);
					КонечныйРезультат = Ложь;

					Продолжить;
				КонецЕсли;

				НовоеПодключение = Новый Структура();
				НовоеПодключение.Вставить("Клиенты"               , Новый Массив());
				НовоеПодключение.Клиенты.Добавить(ИдентификаторКлиента);

				НовоеПодключение.Вставить("Ссылка"                 , Устройство.Ссылка);
				НовоеПодключение.Вставить("ИдентификаторУстройства", Устройство.ИдентификаторУстройства);
				НовоеПодключение.Вставить("Наименование"           , Устройство.Наименование);
				НовоеПодключение.Вставить("ТипОборудования"        , Устройство.ТипОборудования);
				НовоеПодключение.Вставить("ОбработчикДрайвера"     , Устройство.ОбработчикДрайвера);
				НовоеПодключение.Вставить("РабочееМесто"           , Устройство.РабочееМесто);
				НовоеПодключение.Вставить("ИмяКомпьютера"          , Устройство.ИмяКомпьютера);
				НовоеПодключение.Вставить("СетевойПорт"            , Устройство.СетевойПорт);
				НовоеПодключение.Вставить("Параметры", 
				                          МенеджерОборудованияКлиентПовтИсп.ПолучитьПараметрыУстройства(
				                           Устройство.Ссылка));
				НовоеПодключение.Вставить("КоличествоПодключенных", 1);
				НовоеПодключение.Вставить("ПараметрыПодключения"  , Новый Структура());

				Результат = ПолучитьОбработчикаДрайвера(НовоеПодключение.ОбработчикДрайвера).ПодключитьУстройство(
					    ОбъектДрайвера,
					    НовоеПодключение.Параметры,
					    НовоеПодключение.ПараметрыПодключения,
					    ВыходныеПараметры);

				Если Результат Тогда
					Если ВыходныеПараметры.Количество() >= 2 Тогда
						НовоеПодключение.Вставить("ИсточникСобытия", ВыходныеПараметры[0]);
						НовоеПодключение.Вставить("ИменаСобытий",    ВыходныеПараметры[1]);
					Иначе
						НовоеПодключение.Вставить("ИсточникСобытия", "");
						НовоеПодключение.Вставить("ИменаСобытий",    Неопределено);
					КонецЕсли;

					глПодключаемоеОборудование.ПараметрыПодключенияПО.Добавить(НовоеПодключение);
				Иначе
					// Сообщим пользователю о том, что не удалось подключить устройство
					ОписаниеОшибки = ОписаниеОшибки + ?(ПустаяСтрока(ОписаниеОшибки), "", Символы.ПС)
					               + НСтр("ru = 'Не удалось подключить устройство ""%Наименование%"": %ОписаниеОшибки% (%КодОшибки%)'");
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%"  , Устройство.Наименование);
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%КодОшибки%"     , ВыходныеПараметры[0]);
				КонецЕсли;
			Иначе // Устройство было подключено ранее
				//Увеличим количество пользователей данного соединения
				ПодключенноеУстройство.Клиенты.Добавить(ИдентификаторКлиента);
				ПодключенноеУстройство.КоличествоПодключенных = ПодключенноеУстройство.КоличествоПодключенных + 1;
			КонецЕсли;

			КонечныйРезультат = КонечныйРезультат И Результат;
		КонецЦикла;
	ИначеЕсли ИдентификаторУстройства <> Неопределено Тогда
		ОписаниеОшибки = НСтр("ru = 'Выбранное устройство не может использоваться для подключения.
		|Укажите другое устройство.'");
		КонечныйРезультат = Ложь;
	КонецЕсли;

	Возврат КонечныйРезультат;

КонецФункции
////

////////////////// ОТКЛЮЧЕНИЕ ОБОРУДОВАНИЯ //////////////////////////////

// Отключает все подключенное оборудование, соответствующее указанному типу ПО
//
Функция ОтключитьОборудованиеПоТипу(ИдентификаторКлиента, ТипыПО, ОписаниеОшибки = "") Экспорт

	Возврат ОтключитьОборудование(ИдентификаторКлиента, ТипыПО, ,ОписаниеОшибки);

КонецФункции

// Отключает устройство, определенное идентификатором
//
Функция ОтключитьОборудованиеПоИдентификатору(ИдентификаторКлиента, ИдентификаторУстройства, ОписаниеОшибки = "") Экспорт

	Возврат ОтключитьОборудование(ИдентификаторКлиента, , ИдентификаторУстройства, ОписаниеОшибки);

КонецФункции

// Производит принудительное отключение всего подключенного оборудования,
// независимо от числа ссылок на подключение
Функция ОтключитьВсеОборудование(ОписаниеОшибки = "") Экспорт

	КонечныйРезультат = Истина;
	Результат         = Истина;

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	Для каждого ПодключенноеУстройство Из глПодключаемоеОборудование.ПараметрыПодключенияПО Цикл
		ПодключенноеУстройство.КоличествоПодключенных = 0;

		ОбъектДрайвера = ПолучитьОбъектДрайвера(ПодключенноеУстройство.ОбработчикДрайвера);
		Если ОбъектДрайвера = Неопределено Тогда
			//Сообщить об ошибке, что не удалось загрузить драйвер.
			ОписаниеОшибки = НСтр("ru = '""%Наименование%"": Не удалось загрузить драйвер устройства.
			                            |Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", ПодключенноеУстройство.Наименование);
			КонечныйРезультат = Ложь;

			Продолжить;
		КонецЕсли;

		Результат = ПолучитьОбработчикаДрайвера(ПодключенноеУстройство.ОбработчикДрайвера).ОтключитьУстройство(
			    ОбъектДрайвера,
			    ПодключенноеУстройство.Параметры,
			    ПодключенноеУстройство.ПараметрыПодключения,
			    ВыходныеПараметры);

		Если НЕ Результат Тогда
			ОписаниеОшибки = НСтр("ru = 'При отключении устройства ""%Наименование%"" произошла ошибка: %ОписаниеОшибки% (%КодОшибки%)'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", ПодключенноеУстройство.Наименование);
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%КодОшибки%", ВыходныеПараметры[0]);
		КонецЕсли;

		КонечныйРезультат = КонечныйРезультат И Результат;
	КонецЦикла;

	глПодключаемоеОборудование.ПараметрыПодключенияПО.Очистить();

	Возврат КонечныйРезультат;

КонецФункции

// Функция подключает устройства по типу оборудования
// Возвращает результат выполнения функции.
Функция ОтключитьОборудование(ИдентификаторКлиента, ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено, ОписаниеОшибки = "")

	КонечныйРезультат = Истина;
	Результат         = Истина;

	ВходныеПараметры  = Неопределено;
	ВыходныеПараметры = Неопределено;

	ВыходноеОписаниеОшибки = "";

	Если глПодключаемоеОборудование.ПараметрыПодключенияПО <> Неопределено Тогда
		КоличествоУстройств = глПодключаемоеОборудование.ПараметрыПодключенияПО.Количество();
		Для Индекс = 1 По КоличествоУстройств Цикл
			ПодключенноеУстройство = глПодключаемоеОборудование.ПараметрыПодключенияПО[КоличествоУстройств - Индекс];

			ИмяТипаПО = МенеджерОборудованияКлиентПовтИсп.ПолучитьИмяТипаОборудования(ПодключенноеУстройство.ТипОборудования);
			КлиентПодключения = ПодключенноеУстройство.Клиенты.Найти(ИдентификаторКлиента);
			Если КлиентПодключения <> Неопределено
			   И (ТипыПО = Неопределено
				 Или ТипыПО.Найти(ИмяТипаПО) <> Неопределено)
			   И (ИдентификаторУстройства = Неопределено
				 Или ПодключенноеУстройство.Ссылка = ИдентификаторУстройства)Тогда

				Если ПодключенноеУстройство.КоличествоПодключенных = 1 Тогда
					ПодключенноеУстройство.КоличествоПодключенных = 0;

					ОбъектДрайвера = ПолучитьОбъектДрайвера(ПодключенноеУстройство.ОбработчикДрайвера);
					Если ОбъектДрайвера = Неопределено Тогда
						//Сообщить об ошибке, что не удалось загрузить драйвер.
						ОписаниеОшибки = НСтр("ru = '""%Наименование%"": Не удалось загрузить драйвер устройства.
						                            |Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
						ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", ПодключенноеУстройство.Наименование);
						КонечныйРезультат = Ложь;

						Продолжить;
					КонецЕсли;

					Результат = ПолучитьОбработчикаДрайвера(ПодключенноеУстройство.ОбработчикДрайвера).ОтключитьУстройство(
						    ОбъектДрайвера,
						    ПодключенноеУстройство.Параметры,
						    ПодключенноеУстройство.ПараметрыПодключения,
						    ВыходныеПараметры);

					Если НЕ Результат Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ПустаяСтрока(ОписаниеОшибки), "", Символы.ПС)
						               + НСтр("ru = 'При отключении устройства ""%Наименование%"" произошла ошибка: %ОписаниеОшибки% (%КодОшибки%)'");
						ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", ПодключенноеУстройство.Наименование);
						ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
						ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%КодОшибки%", ВыходныеПараметры[0]);
					КонецЕсли;

					НомерСтрокиМассива = глПодключаемоеОборудование.ПараметрыПодключенияПО.Найти(ПодключенноеУстройство);
					Если НомерСтрокиМассива <> Неопределено Тогда
						глПодключаемоеОборудование.ПараметрыПодключенияПО.Удалить(НомерСтрокиМассива);
					КонецЕсли;
				Иначе
					ПодключенноеУстройство.КоличествоПодключенных = ПодключенноеУстройство.КоличествоПодключенных - 1;
					ПодключенноеУстройство.Клиенты.Удалить(КлиентПодключения);
				КонецЕсли;
			КонецЕсли;

			КонечныйРезультат = КонечныйРезультат И Результат;
		КонецЦикла;
	КонецЕсли;

	Возврат КонечныйРезультат;

КонецФункции
////


///////////////////////////////////////////////////
////// ВСПОМОГАТЕЛЬНЫЕ ЭКСПОРТНЫЕ МЕТОДЫ //////////

// Функция, вызываемая при начале работы системы.
// Выполняет подготовку данных механизма
Функция ПриНачалеРаботыСистемы() Экспорт

	Если глПодключаемоеОборудование = Неопределено Тогда
		глПодключаемоеОборудование = Новый Структура("ДрайвераПодключаемогоОборудования,
		                                        |ПараметрыПодключенияПО,
		                                        |ПоследнийСлипЧек,
		                                        |МенеджерОборудованияСтандартныеДрайвераКлиент,
		                                        |ТаблицаУстройствДМ,
		                                        |ПараметрыДрайверМенеджера",
		                                         Новый Соответствие(),
		                                         Новый Массив(),
		                                         "",
		                                         Неопределено,
		                                         Новый Структура(),
		                                         Новый Структура());
	КонецЕсли;

КонецФункции

// Функция, вызываемая при начале работы системы.
// Выполняет подготовку данных механизма
Функция ПередЗавершениемРаботыСистемы() Экспорт

КонецФункции

// Функция осуществляет выбор устройства из списка доступных
// по типу подключаемого оборудования
// Если устройств более одного, то пользователю отображается
// диалог со списком устройств с предложением выбрать "одно из..."
Функция ВыбратьУстройство(ТипПО, ТекстЗаголовкаВыбора, СообщениеНеПодключен) Экспорт

	//Выбор устройства
	Идентификатор = Неопределено;

	Результат = МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
	Если Не Результат Тогда
		Возврат Идентификатор;
	КонецЕсли;

	СписокДоступныхУстройств = 
	 МенеджерОборудованияКлиентПовтИсп.ПолучитьСписокОборудования(ТипПО);

	Если СписокДоступныхУстройств.Количество() = 0 Тогда
		Если Не ПустаяСтрока(СообщениеНеПодключен) ТОгда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеНеПодключен);
		КонецЕсли;
	Иначе
		СписокУстройств = Новый СписокЗначений();
		Для каждого Устройства Из СписокДоступныхУстройств Цикл
			СписокУстройств.Добавить(Устройства.Ссылка, Устройства.Наименование);
		КонецЦикла;

		Если СписокУстройств.Количество() = 1 Тогда
			Идентификатор = СписокУстройств[0].Значение;
		Иначе
			Идентификатор = СписокУстройств.ВыбратьЭлемент(ТекстЗаголовкаВыбора);
			Если Идентификатор <> Неопределено Тогда
				Идентификатор = Идентификатор.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Возврат Идентификатор;

КонецФункции

// Функция предоставляет диалог выбора рабочего места
//
Функция ВыбратьРабочееМесто(ОткрыватьФормуВыбораПриПервомОбращении = Ложь, ИдентификаторКлиента = "") Экспорт

	Результат    = Ложь;
	РабочееМесто = "";

	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОткрыватьПриПервомОбращении", ОткрыватьФормуВыбораПриПервомОбращении);
	ПараметрыФормы.Вставить("ИдентификаторКлиента", ИдентификаторКлиента);
	ФормаВыбораРМ = ПолучитьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаВыбораРабочегоМеста", ПараметрыФормы);
	Ответ = ФормаВыбораРМ.ОткрытьМодально();

	Если Ответ = КодВозвратаДиалога.ОК Тогда
		РМ = ФормаВыбораРМ.Параметры.РабочееМесто;

		МенеджерОборудованияСервер.УстановитьРабочееМестоКлиента(РМ);

		Оповестить("ИзмененоРабочееМестоТекущегоСеанса", РабочееМесто);

		Результат = Истина;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Выполняет обновление имени компьютера в параметре сеанса "РабочееМестоКлиента"
//
Функция ОбновитьРабочееМестоКлиента() Экспорт
	
	Результат = Истина;
	
	РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		СистемнаяИнформация = Новый СистемнаяИнформация();
		
		МассивРабочихМест = МенеджерОборудованияКлиентПовтИсп.НайтиРабочиеМестаПоИД(ВРег(СистемнаяИнформация.ИдентификаторКлиента));
		Если МассивРабочихМест.Количество() = 0 Тогда
			
			Параметры = Новый Структура;
			Параметры.Вставить("ИмяКомпьютера");
			Параметры.Вставить("ИдентификаторКлиента");
			Параметры.Вставить("СетевойПорт");
			
			#Если Не ВебКлиент Тогда
				Параметры.ИмяКомпьютера = ИмяКомпьютера();
			#КонецЕсли
			
			Параметры.ИдентификаторКлиента = СистемнаяИнформация.ИдентификаторКлиента;
			Параметры.СетевойПорт          = МенеджерОборудованияКлиентСервер.ПолучитьСетевойПортПоУмолчанию();
			РабочееМесто = МенеджерОборудованияСервер.СоздатьРабочееМестоКлиента(Параметры);
			
		ИначеЕсли МассивРабочихМест.Количество() = 1 Тогда
			
			РабочееМесто = МассивРабочихМест[0];
			
		ИначеЕсли МассивРабочихМест.Количество() > 1 Тогда
			Результат = МенеджерОборудованияКлиент.ВыбратьРабочееМесто(Истина, ВРег(СистемнаяИнформация.ИдентификаторКлиента));
			
			РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
			
		КонецЕсли;
	КонецЕсли;
	
	Если Результат
		И РабочееМесто <> МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента() Тогда
		МенеджерОборудованияСервер.УстановитьРабочееМестоКлиента(РабочееМесто);
		
		Оповестить("ИзмененоРабочееМестоТекущегоСеанса", РабочееМесто);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Установка из макета драйвера устройства.
//
Процедура УстановитьДрайвер(Идентификатор) Экспорт

	ДанныеОборудования = МенеджерОборудованияСервер.ПолучитьДанныеУстройства(Идентификатор);

	ДрайверУстройства = ДанныеОборудования.ОбработчикДрайвера;
	Попытка
		Если Строка(ДрайверУстройства) = "1С: Сканеры штрихкода"
		 Или Строка(ДрайверУстройства) = "1С: Считыватели магнитных карт" Тогда
			УстановитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.Драйвер1ССканерШтрихкода");
			
		ИначеЕсли Строка(ДрайверУстройства) = "SCANCODE: Сканеры штрихкода" Тогда
			#Если ВебКлиент Тогда
				//УстановитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.ДрайверСканкодСканерШтрихкода");
            #Иначе
				УстановитьДрайверИзДистрибутива("ДрайверСканкодСканерШтрихкода",
				                                "ScancodeScanOpos_8.0.8.19.exe");
			#КонецЕсли
											
		ИначеЕсли Строка(ДрайверУстройства) = "АТОЛ: Сканеры штрихкода"
		      Или Строка(ДрайверУстройства) = "АТОЛ: Считыватели магнитных карт" Тогда
			УстановитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.ДрайверАТОЛСканерШтрихкода");

		ИначеЕсли Строка(ДрайверУстройства) = "1С: Фискальный регистратор (эмулятор)" Тогда
		ИначеЕсли Строка(ДрайверУстройства) = "АТОЛ: Терминалы сбора данных" Тогда
			#Если ВебКлиент Тогда
				УстановитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.ДрайверАтолТСД");
			#Иначе
				УстановитьДрайверИзДистрибутива("ДрайверАТОЛОбщий",
				                                "setup.exe");
			#КонецЕсли

		ИначеЕсли Строка(ДрайверУстройства) = "SCANCODE: Терминалы сбора данных" Тогда
			#Если ВебКлиент Тогда
				//УстановитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.ДрайверСканкодТСДCipherLab");
			#Иначе
				УстановитьДрайверИзДистрибутива("ДрайверСканкодТСДCipherLab",
				                                "CPT_1C_6.0.3.0.exe");
			#КонецЕсли

		ИначеЕсли Строка(ДрайверУстройства) = "Штрих-М: Терминалы сбора данных" Тогда
			#Если ВебКлиент Тогда
				УстановитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.ДрайверШтрихМТСД");
			#Иначе
				УстановитьДрайверИзДистрибутива("ДрайверШтрихМТСД",
				                                "setup.exe");
			#КонецЕсли

		ИначеЕсли Строка(ДрайверУстройства) = "АТОЛ: Дисплеи покупателя" Тогда
			#Если ВебКлиент Тогда
				УстановитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.ДрайверАТОЛДисплеиПокупателя");
			#Иначе
				УстановитьДрайверИзДистрибутива("ДрайверАТОЛОбщий",
				                                "setup.exe");
			#КонецЕсли
										
		ИначеЕсли Строка(ДрайверУстройства) = "SCANCODE: Дисплеи покупателя" Тогда
			#Если ВебКлиент Тогда
				
			#Иначе
				УстановитьДрайверИзДистрибутива("ДрайверСканкодДисплеиПокупателя", "1CDSPPromag_2.1.0.5.exe");
			#КонецЕсли
		
		ИначеЕсли Строка(ДрайверУстройства) = "Штрих-М: Дисплеи покупателя" Тогда
			#Если ВебКлиент Тогда
				
			#Иначе
				УстановитьДрайверИзДистрибутива("ДрайверШтрихМДисплеиПокупателя", "LightPOSDrv_1.2.3.exe");
			#КонецЕсли

		ИначеЕсли Строка(ДрайверУстройства) = "АТОЛ: Электронные весы" Тогда
			#Если ВебКлиент Тогда
				УстановитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.ДрайверАТОЛЭлектронныеВесы");
			#Иначе
				УстановитьДрайверИзДистрибутива("ДрайверАТОЛОбщий",
				                                "setup.exe");
			#КонецЕсли
		КонецЕсли;
	Исключение
	КонецПопытки;

КонецПроцедуры

// Проверяет установлен ли драйвер.
//
Функция ДрайверУстановлен(Идентификатор) Экспорт
	
	ДанныеОборудования = МенеджерОборудованияСервер.ПолучитьДанныеУстройства(Идентификатор);
	
	ОбъектДрайвера = ПолучитьОбъектДрайвера(ДанныеОборудования.ОбработчикДрайвера);
	
	Возврат ОбъектДрайвера <> Неопределено;
	
КонецФункции

#Если Не ВебКлиент Тогда
Процедура УстановитьДрайверИзДистрибутива(ИмяМакета, ИмяФайла) Экспорт

	ВременныйКаталог = КаталогВременныхФайлов();

	// Получение макета с сервера
	СсылкаНаФайл = МенеджерОборудованияСервер.ПолучитьМакетССервера(ИмяМакета);

	// Распаковка архива дистрибутива во временный каталог
	Результат = ПолучитьФайл(СсылкаНаФайл, ВременныйКаталог + "Model.zip", Ложь);
	ФайлМакета = Новый ЧтениеZipФайла();
	ФайлМакета.Открыть(ВременныйКаталог + "Model.zip");
	ВременныйКаталог = ВременныйКаталог + "Model\";

	Для Каждого ЭлементМакета Из ФайлМакета.Элементы Цикл
		Если ЭлементМакета.Имя = ИмяФайла + ".zip" Тогда
			СоздатьКаталог(ВременныйКаталог);
			ФайлМакета.Извлечь(ЭлементМакета, ВременныйКаталог);

			// Распаковка дистрибутива
			ФайлАрхива = Новый ЧтениеZipФайла();
			ФайлАрхива.Открыть(ВременныйКаталог + ЭлементМакета.Имя);
			ФайлАрхива.ИзвлечьВсе(ВременныйКаталог);

			// Запуск инсталлятора
			ЗапуститьПриложение(ВременныйКаталог + ИмяФайла, ВременныйКаталог, Истина);

			// Удаление всех временных файлов после работы
			Попытка
				УдалитьФайлы(ВременныйКаталог);
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;

	// Удаление всех временных файлов после работы
	ВременныйКаталог = СтрЗаменить(ВременныйКаталог, "Model\", "");
	Попытка
		УдалитьФайлы(ВременныйКаталог + "Model.zip");
	Исключение
	КонецПопытки;

КонецПроцедуры
#КонецЕсли

// Возвращает макет слип чека по наименованию макета
//
Функция ПолучитьСлипЧек(ИмяМакета, ШиринаСлипЧека, Параметры) Экспорт

	Возврат МенеджерОборудованияКлиентПовтИсп.ПолучитьСлипЧек(ИмяМакета, ШиринаСлипЧека, Параметры);

КонецФункции

// Перенаправляет команду ответственному обработчику драйвера
// (в соответствии с указанным значением обработчика во входном параметре "Идентификатор")
Функция ВыполнитьКоманду(Идентификатор, Команда, ВходныеПараметры, ВыходныеПараметры, Таймаут = -1) Экспорт

	Результат = Ложь;

	// Поиск подключенного устройства
	ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО,
	                                                        Идентификатор);

	Если ПодключенноеУстройство <> Неопределено Тогда
		// Получение объекта драйвера
		ОбъектДрайвера = ПолучитьОбъектДрайвера(ПодключенноеУстройство.ОбработчикДрайвера);
		Если ОбъектДрайвера = Неопределено Тогда
			//Сообщить об ошибке, что не удалось загрузить драйвер.
			ВыходныеПараметры = Новый Массив();
			ОписаниеОшибки = НСтр("ru = '""%Наименование%"": Не удалось загрузить драйвер устройства.
			                            |Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", ПодключенноеУстройство.Наименование);
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ОписаниеОшибки);

		Иначе
			Параметры            = ПодключенноеУстройство.Параметры;
			ПараметрыПодключения = ПодключенноеУстройство.ПараметрыПодключения;
			ОбработчикДрайвера   = ПодключенноеУстройство.ОбработчикДрайвера;

			// Вызов метода выполнения команды у обработчика
			Результат = ПолучитьОбработчикаДрайвера(ОбработчикДрайвера).ВыполнитьКоманду(Команда,
			                                                                             ВходныеПараметры,
			                                                                             ВыходныеПараметры,
			                                                                             ОбъектДрайвера,
			                                                                             Параметры,
			                                                                             ПараметрыПодключения);
		КонецЕсли;
	Иначе
		//Сообщить об ошибке, что устройство не подключено.
		ВыходныеПараметры = Новый Массив();
		ТекстСообщения = НСтр("ru = 'Устройство не подключено.
			|Перед выполнением операции устройство должно быть подключено.'");
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ТекстСообщения);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Выполняет дополнительную команду к драйверу, не требующую предварительного подключения устройства в системе
//
Функция ВыполнитьДополнительнуюКоманду(Команда, ВходныеПараметры, ВыходныеПараметры,
                                       Идентификатор, Параметры) Экспорт

	Результат = Ложь;

	// Поиск подключенного устройства
	ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО,
	                                                        Идентификатор);

	Если ПодключенноеУстройство = Неопределено Тогда
		ДанныеОборудования = МенеджерОборудованияСервер.ПолучитьДанныеУстройства(Идентификатор);

		времПараметрыПодключения = Новый Структура();

		ОбъектДрайвера = ПолучитьОбъектДрайвера(ДанныеОборудования.ОбработчикДрайвера);
		Если ОбъектДрайвера = Неопределено Тогда
			//Сообщить об ошибке, что не удалось загрузить драйвер.
			ВыходныеПараметры = Новый Массив();
			ТекстСообщения = НСтр("ru = 'Не удалось загрузить драйвер устройства.
			                            |Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ТекстСообщения);
			ВыходныеПараметры.Добавить(НСтр("ru='Не установлен'"));
			
		Иначе
			Результат = ПолучитьОбработчикаДрайвера(ДанныеОборудования.ОбработчикДрайвера).ВыполнитьКоманду(
			    Команда,
			    ВходныеПараметры,
			    ВыходныеПараметры,
			    ОбъектДрайвера,
			    Параметры,
			    времПараметрыПодключения);

			Если Не Результат Тогда
				ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
			КонецЕсли;
		КонецЕсли;
	Иначе
		//Сообщить об ошибке, что устройство подключено.
		ВыходныеПараметры = Новый Массив();
		ТекстСообщения = НСтр("ru = 'Устройство подключено.
			|Перед выполнением операции устройство должно быть отключено.'");
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ТекстСообщения);
		ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Выводить модальную диалоговую форму настройки устройства
//Входные параметры:
//   Устройство   - СправочникСсылка.ПодключаемоеОборудование
Функция ВыполнитьНастройкуОборудования(Идентификатор, НастройкиИзменены = Ложь,СообщениеОбОшибке = "") Экспорт

	Результат = Истина;

	ДанныеУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьДанныеУстройства(Идентификатор);
	ОбработчикДрайвера = ДанныеУстройства.ОбработчикДрайвера;
	ИдентификаторУстройства = ДанныеУстройства.ИдентификаторУстройства;

	//Получить параметры из базы
	ПараметрыОбработки = МенеджерОборудованияКлиентПовтИсп.ПолучитьПараметрыУстройства(Идентификатор);
	ПараметрыОбработки.Вставить("Идентификатор", Идентификатор);

	// Получение формы настройки параметров
	ФормаНастройки = МенеджерОборудованияКлиентПовтИсп.ПолучитьИмяФормыНастройкиПараметров(Строка(ОбработчикДрайвера));
	ФормаНастройки = ПолучитьФорму("Справочник.ПодключаемоеОборудование.Форма." + ФормаНастройки, ПараметрыОбработки);

	Ответ = ФормаНастройки.ОткрытьМодально();
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ПараметрыФормы = ФормаНастройки.Параметры;
		Для каждого СтрокаСпискаЗначений Из ПараметрыФормы.ПараметрыНастройки Цикл
			//Проверка модифицированности предыдущего значения
			ПредыдущееЗначение = Неопределено;

			ПараметрыОбработки.Свойство(СтрокаСпискаЗначений.Представление, ПредыдущееЗначение);
			Если ПредыдущееЗначение <> Неопределено
			   И ПредыдущееЗначение <> СтрокаСпискаЗначений.Значение Тогда
				НастройкиИзменены = Истина; // Есть изменение настроек устройства
			КонецЕсли;

			ПараметрыОбработки.Вставить(СтрокаСпискаЗначений.Представление, СтрокаСпискаЗначений.Значение);
		КонецЦикла;

		Результат = МенеджерОборудованияСервер.СохранитьПараметрыУстройства(Идентификатор, ПараметрыОбработки);
		Если Не Результат Тогда
			СообщениеОбОшибке = НСтр("ru='Не удалось сохранить параметры устройства.'");
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Процедура СохранитьПользовательскиеНастройкиПодключаемогоОборудования(СписокНастроек) Экспорт

	МенеджерОборудованияСервер.СохранитьПользовательскиеНастройкиПодключаемогоОборудования(СписокНастроек);

КонецПроцедуры

/////////////////////////
// МЕТОДЫ РАБОТЫ С ТСД //
/////////////////////////

// Выгружает таблицу с данными в терминал сбора данных
// УникальныйИдентификатор 	- идентификатор формы
// ТаблицаТСД 				- массив структур в которых могут присутствовать только нижеуказанные ключи:
// 	 - Штрихкод
// 	 - Номенклатура
// 	 - ЕдиницаИзмерения
// 	 - ХарактеристикаНоменклатуры
// 	 - СерияНоменклатуры
// 	 - Качество
// 	 - Цена
// 	 - Количество
Процедура ВыгрузитьДанныеВТСД(УникальныйИдентификатор, ТаблицаВыгрузкиВТСД) Экспорт

	ОписаниеОшибки = "";

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		// Подключение устройства
		ИдентификаторУстройства = МенеджерОборудованияКлиент.ВыбратьУстройство("ТерминалСбораДанных",
		    НСтр("ru='Выберите терминал сбора данных'"), НСтр("ru='Терминал сбора данных не подключен'"));

		Если ИдентификаторУстройства <> Неопределено Тогда
			Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			                                                                              ИдентификаторУстройства, ОписаниеОшибки);

			Если Результат Тогда
				// выгружаем в ТСД
				ВходныеПараметры  = Новый Массив();
				ВыходныеПараметры = Неопределено;

				// Преобразуем массив структур в массив списка значений с предопределённым и фиксированным порядком полей:
				// 	0 - Штрихкод
				// 	1 - Номенклатура
				// 	2 - ЕдиницаИзмерения
				// 	3 - ХарактеристикаНоменклатуры
				// 	4 - СерияНоменклатуры
				// 	5 - Качество
				// 	6 - Цена
				// 	7 - Количество
				МассивТСД = Новый Массив;
				Для каждого текСтрока Из ТаблицаВыгрузкиВТСД Цикл
					СтрокаМассиваТСД = Новый СписокЗначений; // не массив для сохранения совместимости с обработками обслуживания
					СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Штрихкод"),						текСтрока.Штрихкод, ""));
					СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Номенклатура"), 				текСтрока.Номенклатура, ""));
					СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("ЕдиницаИзмерения"), 			текСтрока.ЕдиницаИзмерения, ""));
					СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("ХарактеристикаНоменклатуры"), 	текСтрока.ХарактеристикаНоменклатуры, ""));
					СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("СерияНоменклатуры"), 			текСтрока.СерияНоменклатуры, ""));
					СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Качество"), 					текСтрока.Качество, ""));
					СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Цена"), 						текСтрока.Цена, 0));
					СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Количество"), 					текСтрока.Количество, 0));
					МассивТСД.Добавить(СтрокаМассиваТСД);
				КонецЦикла;
				
				ВходныеПараметры.Добавить("Items");
				ВходныеПараметры.Добавить(МассивТСД);

				Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства,
				                                                        "UploadDirectory",
				                                                        ВходныеПараметры,
				                                                        ВыходныеПараметры);

				Если НЕ Результат Тогда
					ТекстСообщения = НСтр("ru='При выгрузке данных в терминал сбора данных произошла ошибка.
					                          |%ОписаниеОшибки%
					                          |Данные в терминал сбора данных не выгружены.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;

				МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
				                                                                 ИдентификаторУстройства);
			Иначе
				ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.
				                          |%ОписаниеОшибки%
				                          |Данные в терминал сбора данных не выгружены.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);

				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

// Загружает в таблицу данные из терминала сбора данных
// УникальныйИдентификатор 	- идентификатор формы
// ТаблицаТСД 				- массив структур с ключами:
// 	 - Штрихкод
// 	 - Количество
Процедура ЗагрузитьДанныеИзТСД(УникальныйИдентификатор, ТаблицаЗагрузкиИзТСД) Экспорт

	ТаблицаЗагрузкиИзТСД = Новый Массив();
	ОписаниеОшибки = "";

	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		// Подключение устройства
		ИдентификаторУстройства = МенеджерОборудованияКлиент.ВыбратьУстройство("ТерминалСбораДанных",
		    НСтр("ru='Выберите терминал сбора данных'"), НСтр("ru='Терминал сбора данных не подключен'"));

		Если ИдентификаторУстройства <> Неопределено Тогда
			Результат = МенеджерОборудованияКлиент.ПодключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
			                                                                              ИдентификаторУстройства, ОписаниеОшибки);

			Если Результат Тогда
				ВходныеПараметры  = Неопределено;
				ВыходныеПараметры = Неопределено;

				Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(ИдентификаторУстройства,
				                                                        "DownloadDocument",
				                                                        ВходныеПараметры,
				                                                        ВыходныеПараметры);

				Если Результат Тогда
					
					Для Индекс = 0 По ВыходныеПараметры[0].Количество()/2 - 1 Цикл
						ТаблицаЗагрузкиИзТСД.Добавить(Новый Структура("Штрихкод, Количество",
						   ВыходныеПараметры[0][Индекс * 2 + 0], ?(ВыходныеПараметры[0][Индекс * 2 + 1] <> Неопределено, ВыходныеПараметры[0][Индекс * 2 + 1], 0)));
					КонецЦикла;

					Оповестить("DataCollectionTerminal", ТаблицаЗагрузкиИзТСД, "ПодключаемоеОборудование");

				Иначе
					
					ТекстСообщения = НСтр("ru='При загрузке данных из терминала сбора данных произошла ошибка.
					                          |%ОписаниеОшибки%
					                          |Данные из терминала сбора данных не загружены.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЕсли;

				МенеджерОборудованияКлиент.ОтключитьОборудованиеПоИдентификатору(УникальныйИдентификатор,
				                                                                 ИдентификаторУстройства);
			Иначе
				ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.
				                          |%ОписаниеОшибки%
				                          |Данные из терминала сбора данных не загружены.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);

				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;

КонецПроцедуры


//////////////////////////////////////////////////////
// ОБЩИЕ МЕТОДЫ ОБРАБОТКИ СОБЫТИЙ ОТ УСТРОЙСТВ

// Производит обработку данных события, полученных от клиента
//
Функция ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки = "") Экспорт

	Результат = Истина;
	ВходныеПараметры  = Новый Массив();
	ВыходныеПараметры = Неопределено;

	// Поиск обработчика события
	Для каждого Подключение Из глПодключаемоеОборудование.ПараметрыПодключенияПО Цикл

		Если Подключение.ИсточникСобытия = ОписаниеСобытия.Источник
		 Или (Подключение.ИсточникСобытия = ""
		   И Подключение.ИменаСобытий <> Неопределено) Тогда

			// Ищем среди подключенного оборудования устройство с полученным событием
			Событие = Подключение.ИменаСобытий.Найти(ОписаниеСобытия.Событие);
			Если Событие <> Неопределено Тогда
				ОбъектДрайвера = ПолучитьОбъектДрайвера(Подключение.ОбработчикДрайвера);
				Если ОбъектДрайвера = Неопределено Тогда
					//Сообщить об ошибке, что не удалось загрузить драйвер.
					ОписаниеОшибки = НСтр("ru = '""%Наименование%"": Не удалось загрузить драйвер устройства.
					                            |Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", Подключение.Наименование);

					Продолжить;
				КонецЕсли;

				ВходныеПараметры.Добавить(ОписаниеСобытия.Событие);
				ВходныеПараметры.Добавить(ОписаниеСобытия.Данные);

				// Обрабатываем сообщение
				Результат = ВыполнитьКоманду(Подключение.Ссылка,
				                      "ОбработатьСобытие",
				                      ВходныеПараметры,
				                      ВыходныеПараметры);
				Если Результат Тогда
					// Оповещаем 
					Оповестить(ВыходныеПараметры[0], ВыходныеПараметры[1], "ПодключаемоеОборудование");
				КонецЕсли;

				// Оповещаем драйвер о завершении обработки события
				ВходныеПараметры.Очистить();
				ВходныеПараметры.Добавить(Результат);
				ВыполнитьКоманду(Подключение.Ссылка,
				                 "ЗавершитьОбработкуСобытия",
				                 ВходныеПараметры,
				                 ВыходныеПараметры);
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции


////////////////////////////////////////
////// ВСПОМОГАТЕЛЬНЫЕ МЕТОДЫ //////////

// Получение объекта драйвера.
//
Функция ПолучитьОбъектДрайвера(ДрайверУстройства) Экспорт

	ОбъектДрайвера = Неопределено;

	Для каждого ДрайверПО Из глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования Цикл
		Если ДрайверПО.Ключ = ДрайверУстройства Тогда
			ОбъектДрайвера = ДрайверПО.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если ОбъектДрайвера = Неопределено Тогда
		Попытка
			Если Строка(ДрайверУстройства) = "1С: Сканеры штрихкода"
			 Или Строка(ДрайверУстройства) = "1С: Считыватели магнитных карт" Тогда
				ПодключитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.Драйвер1ССканерШтрихкода", "Сканер");
				ОбъектДрайвера = Новый ("AddIn.Сканер.Scanner");
				
			ИначеЕсли Строка(ДрайверУстройства) = "SCANCODE: Сканеры штрихкода" Тогда
				#Если ВебКлиент Тогда
					
				#Иначе
					ProgID = "AddIn.ScancodeScanner";
					ПодключитьВнешнююКомпоненту(ProgID);
					ОбъектДрайвера = Новый (ProgID);
				#КонецЕсли

			ИначеЕсли Строка(ДрайверУстройства) = "АТОЛ: Сканеры штрихкода"
			 Или Строка(ДрайверУстройства) = "АТОЛ: Считыватели магнитных карт" Тогда
				ПодключитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.ДрайверАТОЛСканерШтрихкода", "АТОЛСканер");
				ОбъектДрайвера = Новый ("AddIn.АТОЛСканер.Scaner45");

			ИначеЕсли Строка(ДрайверУстройства) = "1С: Фискальный регистратор (эмулятор)" Тогда
				ОбъектДрайвера = "Не требуется";
			ИначеЕсли Строка(ДрайверУстройства) = "АТОЛ: Терминалы сбора данных" Тогда
				#Если ВебКлиент Тогда
					ПодключитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.ДрайверАтолТСД", "АтолТСД");
					ОбъектДрайвера = Новый ("AddIn.АтолТСД.PDX45");
				#Иначе
					ProgID = "AddIn.PDX45";
					ПодключитьВнешнююКомпоненту(ProgID);
					ОбъектДрайвера = Новый (ProgID);
				#КонецЕсли

			ИначеЕсли Строка(ДрайверУстройства) = "SCANCODE: Терминалы сбора данных" Тогда
				#Если ВебКлиент Тогда
					
				#Иначе
					ProgID = "AddIn.CipherLab";
					ПодключитьВнешнююКомпоненту(ProgID);
					ОбъектДрайвера = Новый (ProgID);
				#КонецЕсли

			ИначеЕсли Строка(ДрайверУстройства) = "Штрих-М: Терминалы сбора данных" Тогда
				#Если ВебКлиент Тогда
					ПодключитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.ДрайверШтрихМТСД", "ШтрихМТСД");
					ОбъектДрайвера = Новый ("AddIn.ШтрихМТСД.Terminals");
				#Иначе
					ProgID = "AddIn.Terminals";
					ПодключитьВнешнююКомпоненту(ProgID);
					ОбъектДрайвера = Новый (ProgID);
				#КонецЕсли

			ИначеЕсли Строка(ДрайверУстройства) = "АТОЛ: Дисплеи покупателя" Тогда
				#Если ВебКлиент Тогда
					ПодключитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.ДрайверАТОЛДисплеиПокупателя", "АТОЛДП");
					ОбъектДрайвера = Новый ("AddIn.АТОЛДП.Line45");
				#Иначе
					ProgID = "AddIn.Line45";
					ПодключитьВнешнююКомпоненту(ProgID);
					ОбъектДрайвера = Новый (ProgID);
				#КонецЕсли

			ИначеЕсли Строка(ДрайверУстройства) = "SCANCODE: Дисплеи покупателя" Тогда
				#Если ВебКлиент Тогда
					
				#Иначе
					ProgID = "AddIn.1CDSPPromag";
					ПодключитьВнешнююКомпоненту(ProgID);
					ОбъектДрайвера = Новый (ProgID);
				#КонецЕсли
				
			ИначеЕсли Строка(ДрайверУстройства) = "Штрих-М: Дисплеи покупателя" Тогда
				#Если ВебКлиент Тогда
					
				#Иначе
					ProgID = "AddIn.LineDisplay";
					ПодключитьВнешнююКомпоненту(ProgID);
					ОбъектДрайвера = Новый (ProgID);
				#КонецЕсли
				
			ИначеЕсли Строка(ДрайверУстройства) = "АТОЛ: Электронные весы" Тогда
				#Если ВебКлиент Тогда
					ПодключитьВнешнююКомпоненту("Справочник.ПодключаемоеОборудование.Макет.ДрайверАТОЛЭлектронныеВесы", "АТОЛЭВ");
					ОбъектДрайвера = Новый ("AddIn.АТОЛЭВ.Scale45");
				#Иначе
					ProgID = "AddIn.Scale45";
					ПодключитьВнешнююКомпоненту(ProgID);
					ОбъектДрайвера = Новый (ProgID);
				#КонецЕсли
			ИначеЕсли Строка(ДрайверУстройства) = "ACOM: Весы с печатью этикеток" Тогда
				ОбъектДрайвера = ""; // Драйвер не требуется
				
			ИначеЕсли Строка(ДрайверУстройства) = "Штрих-М: Весы с печатью этикеток" Тогда
				#Если ВебКлиент Тогда
					
				#Иначе
					ProgID = "AddIn.DrvLP";
					ПодключитьВнешнююКомпоненту(ProgID);
					ОбъектДрайвера = Новый (ProgID);
				#КонецЕсли

			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

	Если ОбъектДрайвера <> Неопределено Тогда
		глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДрайверУстройства, ОбъектДрайвера);
		ОбъектДрайвера = глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования[ДрайверУстройства];
	КонецЕсли;

	Возврат ОбъектДрайвера;

КонецФункции

// Функция возвращает объект обработчика драйвера по его наименованию
//
Функция ПолучитьОбработчикаДрайвера(ОбработчикДрайвера) Экспорт

	Результат = Неопределено;

	// Вызов метода выполнения команды у обработчика
	Если ОбработчикДрайвера <> Неопределено Тогда
		Если Строка(ОбработчикДрайвера) = "1С: Сканеры штрихкода" Тогда
			Результат = ПодключаемоеОборудование1ССканерыШтрихкода;
			
		ИначеЕсли Строка(ОбработчикДрайвера) = "SCANCODE: Сканеры штрихкода" Тогда
			Результат = ПодключаемоеОборудованиеСканкодСканерыШтрихкода;

		ИначеЕсли Строка(ОбработчикДрайвера) = "АТОЛ: Сканеры штрихкода" Тогда
			Результат = ПодключаемоеОборудованиеАтолСканерыШтрихкода;

		ИначеЕсли Строка(ОбработчикДрайвера) = "1С: Фискальный регистратор (эмулятор)" Тогда
			Результат = ПодключаемоеОборудование1СФискальныйРегистраторЭмулятор;
		ИначеЕсли Строка(ОбработчикДрайвера) = "АТОЛ: Терминалы сбора данных" Тогда
			Результат = ПодключаемоеОборудованиеАтолТерминалыСбораДанных;

		ИначеЕсли Строка(ОбработчикДрайвера) = "SCANCODE: Терминалы сбора данных" Тогда
			Результат = ПодключаемоеОборудованиеСканкодТерминалыСбораДанных;

		ИначеЕсли Строка(ОбработчикДрайвера) = "Штрих-М: Терминалы сбора данных" Тогда
			Результат = ПодключаемоеОборудованиеШтрихМТерминалыСбораДанных;

		ИначеЕсли Строка(ОбработчикДрайвера) = "АТОЛ: Дисплеи покупателя" Тогда
			Результат = ПодключаемоеОборудованиеАтолДисплеиПокупателя;
			
		ИначеЕсли Строка(ОбработчикДрайвера) = "SCANCODE: Дисплеи покупателя" Тогда
			Результат = ПодключаемоеОборудованиеСканкодДисплеиПокупателя;
			
		ИначеЕсли Строка(ОбработчикДрайвера) = "Штрих-М: Дисплеи покупателя" Тогда
			Результат = ПодключаемоеОборудованиеШтрихМДисплеиПокупателя;

		ИначеЕсли Строка(ОбработчикДрайвера) = "1С: Считыватели магнитных карт" Тогда
			Результат = ПодключаемоеОборудование1ССчитывателиМагнитныхКарт;

		ИначеЕсли Строка(ОбработчикДрайвера) = "АТОЛ: Считыватели магнитных карт" Тогда
			Результат = ПодключаемоеОборудованиеАтолСчитывателиМагнитныхКарт;

		ИначеЕсли Строка(ОбработчикДрайвера) = "АТОЛ: Электронные весы" Тогда
			Результат = ПодключаемоеОборудованиеАтолЭлектронныеВесы;
		ИначеЕсли Строка(ОбработчикДрайвера) = "ACOM: Весы с печатью этикеток" Тогда
			Результат = ПодключаемоеОборудованиеACOMВесыСПечатьюЭтикеток;
			
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

//Поиск по идентификатору подключенного ранее устройства
//
Функция ПолучитьПодключенноеУстройство(СписокПодключений, Идентификатор)

	ПодключенноеУстройство = Неопределено;

	Для каждого Подключение Из СписокПодключений Цикл
		Если Подключение.Ссылка = Идентификатор Тогда
			ПодключенноеУстройство = Подключение;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат ПодключенноеУстройство;

КонецФункции
